{"url": "https://www.wbaltv.com/article/26m-plan-to-renovate-lexington-market-detailed-in-report/7091583", "fetchtime": "2020-05-06T14:22:27+00:00", "keywords": ["lexington market", " renovation", " baltimore", " report"], "language": "en", "source": "WBAL", "headline": "Report details plan to renovate Lexington Market", "summary": "A consulting company has developed a 333-page report and attached a $26 million price tag to a plan to renovate Baltimore's historic Lexington Market.", "modtime": "2019-06-26T22:06:35+00:00", "firstpubtime": "2015-01-31T03:51:00+00:00", "section": "News", "originalurl": "https://www.wbaltv.com/article/26m-plan-to-renovate-lexington-market-detailed-in-report/7091583", "previousfetches": 0, "bodytext": "      A consulting company has developed a 333-page report and attached a $26 million price tag to a plan to renovate Baltimore's historic Lexington Market.PDF files: Lexington Market report: Phase 1 | Phase 2Mobile users tap here to watch videoLexington Market is a staple in the community, but many agree that changes need to be made. A consulting firm has come up with ways to help revive the market, increase safety and bring in more tourists.\"I really love the place. It's got a really great culture, a great atmosphere. I just really love the energy of the place,\" said Mark Stubenberg, a customer.\"I've been coming to Lexington Market since I was a little girl with my mother. We came down here just about every weekend,\" said Lisa Cotton, a customer.Lexington Market has been operating in downtown Baltimore since 1782. The historic building is in desperate need of repair.\"There are things in here that have gotten old,\" said Nancy Faidley, co-owner of Faidley's Seafood.According to the report, the entire electrical system needs to be replaced. There are also problems with the building's mechanical, plumbing and fire safety systems. The report also cites merchants who are \"very concerned about the degraded facility, security and cleanliness.\"\"The plumbing, the electrical (system), maybe I have to Jerry-rig stuff because there isn't enough electricity to (make it work), those kinds of things, I think, are desperately needed,\" Faidley said.\"I know that with the institutions that we have around there, and the bones of Lexington Market, we can get back there, but it's going to take doing the study and making the investments to get us to where Lexington Market is an asset for residents and a destination for visitors,\" Baltimore Mayor Stephanie Rawlings-Blake said.The report also cites drug activity and loitering as reasons why customers avoid the area.\"I think more cameras need to be here as well,\" Cotton said.\"I don't want it to be some slick-looking kind of contemporary (place). I want it to hold its charm,\" Faidley said.The report is only a proposal, and no date has been set for when changes might occur.              BALTIMORE —              A consulting company has developed a 333-page report and attached a $26 million price tag to a plan to renovate Baltimore's historic Lexington Market. PDF files: Lexington Market report:  Phase 1  |  Phase 2                              Advertisement                                     Related Content                        Baltimore residents offer input on new Lexington Market plan                                 Mobile users tap here to watch video Lexington Market is a staple in the community, but many agree that changes need to be made. A consulting firm has come up with ways to help revive the market, increase safety and bring in more tourists. \"I really love the place. It's got a really great culture, a great atmosphere. I just really love the energy of the place,\" said Mark Stubenberg, a customer. \"I've been coming to Lexington Market since I was a little girl with my mother. We came down here just about every weekend,\" said Lisa Cotton, a customer. Lexington Market has been operating in downtown Baltimore since 1782. The historic building is in desperate need of repair. \"There are things in here that have gotten old,\" said Nancy Faidley, co-owner of Faidley's Seafood. According to the report, the entire electrical system needs to be replaced. There are also problems with the building's mechanical, plumbing and fire safety systems. The report also cites merchants who are \"very concerned about the degraded facility, security and cleanliness.\" \"The plumbing, the electrical (system), maybe I have to Jerry-rig stuff because there isn't enough electricity to (make it work), those kinds of things, I think, are desperately needed,\" Faidley said. \"I know that with the institutions that we have around there, and the bones of Lexington Market, we can get back there, but it's going to take doing the study and making the investments to get us to where Lexington Market is an asset for residents and a destination for visitors,\" Baltimore Mayor Stephanie Rawlings-Blake said. The report also cites drug activity and loitering as reasons why customers avoid the area. \"I think more cameras need to be here as well,\" Cotton said. \"I don't want it to be some slick-looking kind of contemporary (place). I want it to hold its charm,\" Faidley said. The report is only a proposal, and no date has been set for when changes might occur.                         ", "sentiment": 0.1496580387205387, "subjectivity": 0.4919928451178452, "wordcount": 724}
{"url": "https://www.wbaltv.com/article/police-respond-in-full-force-to-celebrate-birthday-of-boy-with-autism/29371673", "fetchtime": "2020-05-06T14:22:28+00:00", "bylines": ["Chris Chandler"], "keywords": ["AUTISM", " BIRTHDAY", " HAPPY", " LMPD", " LOUISVILLE", " POLICE", " SURPRISE", " WLKY", " dhnd", " happy news", " good news"], "language": "en", "source": "WBAL", "headline": "Police respond in full force to celebrate birthday of boy with autism", "summary": "Malachi loves police officers, so his mother posted on Facebook looking for an officer to come to his 9th birthday party.", "modtime": "2019-10-05T00:40:03+00:00", "firstpubtime": "2019-10-05T00:39:00+00:00", "section": "News", "originalurl": "https://www.wbaltv.com/article/police-respond-in-full-force-to-celebrate-birthday-of-boy-with-autism/29371673", "previousfetches": 0, "bodytext": "      A Kentucky boy with autism got to experience an extremely special birthday party Friday.Malachi loves police officers, so his mother posted on Facebook looking for an officer to come to his 9th birthday party.Louisville Metro Police Department’s 2nd Division, the Jefferson County Sheriff’s Office and the Lake Dreamland Fire Department certainly answered the call, coming out in full force with more than a dozen officers showing up to celebrate Malachi's birthday.Malachi got to test out the police cruiser's sirens, he opened gifts, and he even got a custom LMPD cake. He was even sworn in as an officer for the day.His family and the responding officers said it was a special opportunity.\"What better gift could we give him? It's an honor to represent LMPD in this capacity and just show love,\" officer Ivan Haygood said. \"This is what this is about: our service to him.\"Malachi's family said he wants to be a police officer when he grows up.             LOUISVILLE, Ky. —              A Kentucky boy with autism got to experience an extremely special birthday party Friday.                              Advertisement                       Malachi loves police officers, so his mother posted on Facebook looking for an officer to come to his 9th birthday party. Louisville Metro Police Department’s 2nd Division, the Jefferson County Sheriff’s Office and the Lake Dreamland Fire Department   certainly answered the call, coming out in full force with more than a dozen officers showing up to celebrate Malachi's birthday. Malachi got to test out the police cruiser's sirens, he opened gifts, and he even got a custom LMPD cake. He was even sworn in as an officer for the day.                                                                              His family and the responding officers said it was a special opportunity. \"What better gift could we give him? It's an honor to represent LMPD in this capacity and just show love,\" officer Ivan Haygood said. \"This is what this is about: our service to him.\" Malachi's family said he wants to be a police officer when he grows up.                        ", "sentiment": 0.33095238095238094, "subjectivity": 0.4404761904761904, "wordcount": 326}
{"url": "https://www.wbaltv.com/article/its-been-a-long-a-long-journey-deported-veteran-sworn-in-as-us-citizen/29373511", "fetchtime": "2020-05-06T14:22:28+00:00", "keywords": ["U.S. citizen", " deportation", " green card", " veteran", " khnd"], "language": "en", "source": "WBAL", "headline": "'It's been a long ... a long journey': Deported veteran sworn in as US citizen", "summary": "The call Army veteran Miguel Perez had been waiting years for came Friday.", "modtime": "2019-10-05T09:03:47+00:00", "firstpubtime": "2019-10-05T09:03:00+00:00", "section": "News", "originalurl": "https://www.wbaltv.com/article/its-been-a-long-a-long-journey-deported-veteran-sworn-in-as-us-citizen/29373511", "previousfetches": 0, "bodytext": "      The call Army veteran Miguel Perez had been waiting years for came Friday. It was from immigration officials who phoned his attorney to see how quickly Perez could come to downtown Chicago to take his oath to become a U.S. citizen.Just two months ago, Perez doubted this day would ever come. He had been stripped of his green card and deported to Mexico, despite his military service that included deployments to Afghanistan.But his history also included a felony drug conviction in Illinois and a prison term of more than seven years.He was sent back to Mexico, the country he left when he was 8 when his family came to the United States so his father could pursue a soccer career.Things changed two months ago when Illinois Gov. J. B. Pritzker granted Perez clemency for his conviction. Attorney Chris Bergin and Perez took it as a new argument for Perez's citizenship.Last month, U.S. officials allowed Perez to come to Chicago to make his case, which was supported by U.S. Sen. Tammy Duckworth, an Illinois Democrat who served in Iraq with the Illinois Army National Guard.At noon Friday, Bergin got the call from U.S. Citizenship and Immigration Services who wanted to know when they could have a ceremony.\"I said we'll be there right away,\" Bergin said.Perez didn't believe Bergin at first.\"I was like no way. Seriously? He was like, 'Yeah, it's official,' \" Perez said.He still was skeptical it was really happening until they had him raise his right hand, swear an oath and gave him a paper affirming his citizenship. A Facebook video from Green Card Veterans shows Perez completing his oath, then turn to the US flag and salute.\"It's been a long ... a long journey, a long battle,\" Perez said.Duckworth sent her best wishes.\"I am so proud to finally be able to call Miguel Perez a fellow American,\" she said. \"He sacrificed for our nation by serving overseas and, while this is long overdue, I'm glad Miguel can now breathe a sigh of relief and celebrate becoming a citizen of the country he loves and considers home.\"Perez said the most important thing now was to take care of his mental health.Perez has said the stress of two deployments to Afghanistan -- one in 2002 and the other in 2003 -- caused post traumatic stress disorder, which led to his drug addiction.He ultimately was convicted for delivering more than two pounds of cocaine to an undercover officer in 2008. He pleaded guilty and was sentenced in 2010. He served a prison sentence and then was turned over to immigration officials in 2016. He was deported in 2018.Now that he is back in the United States, he can work with Veterans Affairs to get treatment.\"I get to take care of my health, first and foremost,\" he said. He was at a hospital Friday when he got the news about his citizenship.He also wants to spend time with his family -- his two children and parents are citizens -- and advocate on behalf of other veterans who have been deported.When asked what he'll be doing on his first day as a U.S. citizen, Perez said he will be spending time with his son and going bowling.             CHICAGO —              The call Army veteran Miguel Perez had been waiting years for came Friday. It was from immigration officials who phoned his attorney to see how quickly Perez could come to downtown Chicago to take his oath to become a U.S. citizen. Just two months ago, Perez doubted this day would ever come. He had been stripped of his green card and deported to Mexico, despite his military service that included deployments to Afghanistan.                              Advertisement                       But his history also included a felony drug conviction in Illinois and a prison term of more than seven years. He was sent back to Mexico, the country he left when he was 8 when his family came to the United States so his father could pursue a soccer career. Things changed two months ago when Illinois Gov. J. B. Pritzker granted Perez clemency for his conviction. Attorney Chris Bergin and Perez took it as a new argument for Perez's citizenship. Last month, U.S. officials allowed Perez to come to Chicago to make his case, which was supported by U.S. Sen.  Tammy Duckworth , an Illinois Democrat who served in Iraq with the Illinois Army National Guard. At noon Friday, Bergin got the call from U.S. Citizenship and Immigration Services who wanted to know when they could have a ceremony. \"I said we'll be there right away,\" Bergin said. Perez didn't believe Bergin at first. \"I was like no way. Seriously? He was like, 'Yeah, it's official,' \" Perez said. He still was skeptical it was really happening until they had him raise his right hand, swear an oath and gave him a paper affirming his citizenship. A  Facebook video  from Green Card Veterans shows Perez completing his oath, then turn to the US flag and salute.                        \"It's been a long ... a long journey, a long battle,\" Perez said. Duckworth sent her best wishes. \"I am so proud to finally be able to call Miguel Perez a fellow American,\" she said. \"He sacrificed for our nation by serving overseas and, while this is long overdue, I'm glad Miguel can now breathe a sigh of relief and celebrate becoming a citizen of the country he loves and considers home.\" Perez said the most important thing now was to take care of his mental health. Perez has said the stress of two deployments to Afghanistan -- one in 2002 and the other in 2003 -- caused post traumatic stress disorder, which led to his drug addiction. He ultimately was convicted for delivering more than two pounds of cocaine to an undercover officer in 2008. He pleaded guilty and was sentenced in 2010. He served a prison sentence and then was turned over to immigration officials in 2016. He was deported in 2018. Now that he is back in the United States, he can work with Veterans Affairs to get treatment. \"I get to take care of my health, first and foremost,\" he said. He was at a hospital Friday when he got the news about his citizenship. He also wants to spend time with his family -- his two children and parents are citizens -- and advocate on behalf of other veterans who have been deported. When asked what he'll be doing on his first day as a U.S. citizen, Perez said he will be spending time with his son and going bowling.                        ", "sentiment": 0.13220779220779222, "subjectivity": 0.428025974025974, "wordcount": 1092}
{"url": "https://www.wbaltv.com/article/mom-wears-unicorn-costume-at-bus-stop-in-attempt-to-slow-down-speeders/29353537", "fetchtime": "2020-05-06T14:22:29+00:00", "keywords": ["Ohio", " bus stop", " cars", " children", " drivers", " speed", " speeding", " unicorn", " khnd"], "language": "en", "source": "WBAL", "headline": "Mom wears unicorn costume at bus stop in attempt to slow down speeders", "summary": "She holds a sign that says, \"Want to be magical? Slow down, 25 mph.\"", "modtime": "2019-10-03T16:38:26+00:00", "firstpubtime": "2019-10-03T16:38:00+00:00", "section": "News", "originalurl": "https://www.wbaltv.com/article/mom-wears-unicorn-costume-at-bus-stop-in-attempt-to-slow-down-speeders/29353537", "previousfetches": 0, "bodytext": "      An Ohio mom is on a mission to bring awareness to speeding at bus stops.Beth Phillips Blair has been dressing up as a unicorn or mama bear at her kid's bus stop for the past two years, WKEF reports. She holds signs that say, \"Want to be magical? Slow down, 25 mph,\" and, \"Stop for school buses.\"Blair told the news outlet that police do a good job, but drivers still fly by on the 25 mph road.\"The kids love it. It's just crazy how she dresses up, but it's not crazy because she's obviously concerned,\" said Kent Parker, a school bus driver.According to WKEF, a spokesperson with the local police department said its traffic safety program monitors areas that have high speeding complaints. The department added that a dancing unicorn may distract drivers.             CENTERVILLE, Ohio (Video by WKEF via CNN) —              An Ohio mom is on a mission to bring awareness to speeding at bus stops. Beth Phillips Blair has been dressing up as a unicorn or mama bear at her kid's bus stop for the past two years,  WKEF  reports. She holds signs that say, \"Want to be magical? Slow down, 25 mph,\" and, \"Stop for school buses.\"                              Advertisement                       Blair told the news outlet that police do a good job, but drivers still fly by on the 25 mph road. \"The kids love it. It's just crazy how she dresses up, but it's not crazy because she's obviously concerned,\" said Kent Parker, a school bus driver. According to WKEF, a spokesperson with the local police department said its traffic safety program monitors areas that have high speeding complaints. The department added that a dancing unicorn may distract drivers.                        ", "sentiment": 0.13787037037037034, "subjectivity": 0.5732407407407408, "wordcount": 279}
{"url": "https://www.wbaltv.com/article/decked-with-dollar15-million-in-jewels-this-may-be-the-worlds-most-expensive-christmas-tree/30146225", "fetchtime": "2020-05-06T14:22:29+00:00", "keywords": ["Christmas", " Christmas tree", " jewels", " khnd"], "language": "en", "source": "WBAL", "headline": "Decked with $15 million in jewels, this may be the world's most expensive Christmas tree", "summary": "WOW! This Christmas tree is decorated with red, white, pink and black diamonds.", "modtime": "2019-12-06T10:13:20+00:00", "firstpubtime": "2019-12-06T10:13:00+00:00", "section": "News", "originalurl": "https://www.wbaltv.com/article/decked-with-dollar15-million-in-jewels-this-may-be-the-worlds-most-expensive-christmas-tree/30146225", "previousfetches": 0, "bodytext": "      Christmas is the season for giving, spending time with family and relaxing after a busy year.For some, it is also a time of extravagance.This Christmas, visitors to the Kempinski Hotel Bahia, near Marbella, Spain will be treated to the sight of the hotel's tree, decked out with diamonds, precious stones and designer jewelry.Decorated with red, white, pink and black diamonds, the tree, designed by Debbie Wingham, is worth a staggering $15 million, according to the hotel.As well as diamonds, the tree is embellished with upcycled jewelry from Bulgari, Cartier, Van Cleef & Arpels and Chanel, 3D-printed chocolate peacocks, feathers, ostrich eggs and bottles of perfume.The Kempinski's festive fir is the latest in a short but very sparkly line of decadently decorated trees.In 2010, The Emirates Palace hotel in Abu Dhabi adorned a tree in bracelets, necklaces and watches -- to the tune of $11 million, winning it a Guinness World Record for most expensively decorated tree.And in 2016, Tokyo jewelers Ginza Tanaka displayed a Christmas tree made from 4,000 feet of gold wire, worth an estimated $1.8 million.                        Christmas is the season for giving, spending time with family and relaxing after a busy year. For some, it is also a time of extravagance.                              Advertisement                       This Christmas, visitors to the Kempinski Hotel Bahia, near Marbella, Spain will be treated to the sight of the hotel's tree, decked out with diamonds, precious stones and designer jewelry. Decorated with red, white, pink and black diamonds, the tree, designed by Debbie Wingham, is worth a staggering $15 million, according to the hotel. As well as diamonds, the tree is embellished with upcycled jewelry from Bulgari, Cartier, Van Cleef & Arpels and Chanel, 3D-printed chocolate peacocks, feathers, ostrich eggs and bottles of perfume. The Kempinski's festive fir is the latest in a short but very sparkly line of decadently decorated trees. In 2010, The Emirates Palace hotel in Abu Dhabi adorned a tree in bracelets, necklaces and watches --  to the tune of $11 million , winning it a Guinness World Record for most expensively decorated tree. And in 2016, Tokyo jewelers Ginza Tanaka displayed a Christmas tree made from 4,000 feet of gold wire, worth an estimated $1.8 million.                        ", "sentiment": 0.1488888888888889, "subjectivity": 0.4055555555555556, "wordcount": 365}
{"url": "https://www.wbaltv.com/article/police-need-publics-help-locating-missing-kenneth-james-adams-with-medical-condition/32383621", "fetchtime": "2020-05-06T14:22:29+00:00", "keywords": ["Dundalk", " Kenneth James Adams", " missing", " wbal tv"], "language": "en", "source": "WBAL", "headline": "Police locate boy with medical condition", "summary": "Baltimore County police said they have located a missing teenage boy who has a medical condition.", "modtime": "2020-05-06T10:25:46+00:00", "firstpubtime": "2020-05-06T10:25:00+00:00", "section": "News", "originalurl": "https://www.wbaltv.com/article/police-need-publics-help-locating-missing-kenneth-james-adams-with-medical-condition/32383621", "previousfetches": 0, "bodytext": "      Baltimore County police said they have located a missing teenage boy who has a medical condition.               DUNDALK, Md. —              Baltimore County police said they have located a missing teenage boy who has a medical condition.                                                                                                         Get WBAL-TV 11 News On The Go                                                       Advertisement                                             ", "sentiment": -0.06666666666666667, "subjectivity": 0.016666666666666666, "wordcount": 43}
